export const Help = () => {
    return `<div class="container">
        <h1>Правила шашек:</h1>
        <div>
            Русские шашки — традиционный и наиболее популярный вид шашек в России, странах бывшего СССР и в Израиле.
            Каждому игроку принадлежит 12 простых шашек, занимающие в начальной позиции чёрные поля первых трёх
            горизонталей, ближайших к игроку. Первый ход делают белые.

            Основные особенности:

            Шашки ходят только по клеткам тёмного цвета.
            Доска расположена так, чтобы угловое поле внизу слева со стороны игрока было тёмным.
            Простая шашка бьёт вперёд и назад, дамка ходит и бьёт на любое поле диагонали.
            Во время боя простая шашка может превратиться в дамку и сразу продолжить бой по правилам дамки.
            При наличии нескольких вариантов боя можно выбрать любой из них.
        </div>
    </div>`;
}

export const HelpHeader = () => {
    return `<a class="orange-button" href="../index.html" id="main">Главная</a>`;
}
export const HelpHead = () => {
    return `<title>Помощь</title>
    <link href="./styles/help.css" rel="stylesheet"/>`
}


